app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
    def index
        if params[:project_id]
            categories = Project.find(params[:project_id]).categories
            render json: CategorisingSerializer.new(categories).to_serialized_json
        else
            categories = Category.all

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        if params[:project_id]
            project = Project.find_by(id: params[:project_id])
            if project.nil?
            redirect_to projects_path, alert: "Project not found."
            else
            category = project.categories.find_by(id: params[:id])
            redirect_to project_categories_path(project), alert: "Category not found." if category.nil?
            end
        else
            category = Category.find_by(id: params[:id])