app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
		project = Project.find(params[:id])