app/controllers/sections_controller.rb

    def index
        sections = Section.all
---
SELECT "sections".* FROM "sections"

    def show
        section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def edit
        section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]